Revit 2027 API
View.Scale Property
The scale of the view.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public int Scale { get; set; }
Public Property Scale As Integer
	Get
	Set
public:
property int Scale {
	int get ();
	void set (int value);
}
member Scale : int with get, set
Property Value
Int32
Remarks
The scale is the ratio of true model size to paper size. This property is meaningless for perspective views. When setting the scale if the scale corresponds to a predefined scale, the predefined item will be applied. Otherwise, a custom scale will be applied.
See Also
Reference
View Class
Autodesk.Revit.DB Namespace